Repository: 84000/data-translation-memory
Catalog: toh232-v4.tmx
Source language: bo
Languages: en

source: ཚུལ་ཁྲིམས་ཀྱིས་ཕྱུག་པར་ཡང་འགྱུར་བ་དང་།
en: How can we become rich with discipline?

source: ཆོས་ཀྱིས་ཕྱུག་པར་ཡང་འགྱུར་བ་དང་།
en: How can we become rich with Dharma?

source: དཔྲོག་ཏུ་མ་མཆིས་པའི་རྫས་ཀྱིས་ཕྱུག་པར་ཡང་འགྱུར་བ་དང་།
en: How can we become rich with goods that were not obtained by stealing?

source: སྐྱེ་བོ་དབུལ་པོ་སློང་བ་ལ་སོགས་པ་ལ་གཏེར་ལྟ་བུར་ཡང་འགྱུར་བ་དང་།
en: How can we become like a treasury for all poor beings and beggars?

source: སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཆོས་རྣམས་སྟོན་པ་ན་མི་སྐྲག་མི་དངང་ཞིང་དངང་བར་ཡང་མི་འགྱུར་བ་དང་།
en: How can we not become fearful or panic stricken and never panic when it is taught that all phenomena are empty, signless, and wishless?

source: སངས་རྒྱས་ཀྱི་ཞིང་གང་དང་གང་དུ་སྐྱེ་བར་བགྱི་བར་སེམས་བསྐྱེད་པ་དེ་དང་དེར་སྐྱེ་བར་ཡང་འགྱུར་བ་དང་།
en: How can we attain birth within whichever buddhafield we aspire to be born into?

source: རྙེད་པ་དང་། བཀུར་སྟི་དང་། ཚིགས་སུ་བཅད་པ་དོན་དུ་མི་གཉེར་བར་ཡང་འགྱུར་བ་དང་།
en: How do we refrain from seeking after gain, respect, and praise?

source: ཚུལ་ཁྲིམས་འཆལ་བ་རྣམས་བསྡུས་ནས་དམ་པའི་ཆོས་ལ་འགོད་པར་ཡང་འགྱུར་བ་དང་།
en: “How can we gather all those with lax discipline and establish them within the sacred Dharma?

source: ཚུལ་ཁྲིམས་འཆལ་པ་གཡོ་སྒྱུ་དང་ལྡན་པ་རྣམས་ལ་ཐོག་ཏོག་ལྟ་བུར་ཡང་འགྱུར་བ་དང་།
en: How can we be like a hailstorm among all those who possess lax discipline and devious minds?

source: དེ་བཞིན་གཤེགས་པ་ལ་བྱས་པ་མི་གཟོ་བ་རྣམས་བྱས་པ་གཟོ་བ་ལ་ཡང་དག་པར་སྦྱོར་བར་ཡང་འགྱུར་བ་དང་།
en: How can we cause all those who do not appreciate the Tathāgata’s kindness to develop proper appreciation?

source: མུ་སྟེགས་ཅན་གྱི་གནས་ཐམས་ཅད་དུ་མི་འཕྲོགས་པར་ཡང་འགྱུར་ཞིང་སླར་དེ་ལ་ཐབས་དང་ལྡན་པར་ཡང་འགྱུར་བ་དང་།
en: How can we become unassailable within the abodes of the non-Buddhist schools and, moreover, treat them with skillful means?

source: དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། མུ་སྟེགས་ཅན་ཕས་ཀྱི་རྒོལ་བ་མང་པོ་དག་གིས་ཕུག་རྡུགས་སུ་མི་ཆུད་ཅིང་སླར་དེ་ལ་ཐབས་ཀྱིས་རྟོན་པར་ཡང་འགྱུར་བ་དང་།
en: How can we not be dug into a hole by the many arguments of ascetics, brahmins, and non-Buddhists and, moreover, rely on skillful means when dealing with them?

source: མུ་སྟེགས་ཅན་གྱི་གནས་ཐམས་ཅད་ཀྱི་གསང་ཚིག་རྣམས་ལ་འདུན་པར་མི་འགྱུར་ཞིང་སླར་དེ་ལ་ཐབས་ཀྱིས་འདུན་པར་བགྱིད་པར་ཡང་འགྱུར་བ་དང་།
en: How can we never take interest in the esoteric teachings of all the non-Buddhist schools and, moreover, arouse their interest through skillful means?

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟའི་གནས་ཐམས་ཅད་ལ་རྟེན་པར་མི་འགྱུར་ཞིང་།
en: How can we never dwell in the abodes of the gods, nāgas, yakṣas, and gandharvas and, moreover, truly support them with skillful means?

source: སླར་དེ་ལ་ཐབས་ཀྱིས་ཡང་དག་པར་རྟེན་པ་ལྟ་བུར་ཡང་འགྱུར་བ་དང་། ལས་ལ་རྟོན་པར་འགྱུར་གྱི་བཀྲ་ཤིས་དང་།
en: “How can we make sure to never rely upon auspicious and propitious signs that are karmically conditioned?

source: དགེ་མཚན་ལ་རྟོན་པར་ཡང་མི་འགྱུར་བ་དང་།
en: How can we engage in taking life while abandoning taking life?

source: སྲོག་གཅོད་པ་བགྱིད་ཀྱང་སྲོག་གཅོད་པ་སྤངས་པར་ཡང་འགྱུར་བ་དང་། མེ་ཏོག་ཕྲེང་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མས་གདབ་པ་དང་། ཁྱིམ་པའི་ལོངས་སྤྱོད་དང་། ཡོངས་སུ་སྤྱད་པ་རྣམ་པ་དུ་མ་དག་དང་། ཆུང་མ་དང་ལྷན་ཅིག་འདོད་པའི་ཡོན་ཏན་སྤྱད་ཀྱང་ཤིན་ཏུ་ཚངས་པར་སྤྱོད་པར་ཡང་འགྱུར་བ་དང་།
en: How can we simultaneously partake of all sense pleasures—flower garlands, fragrances, lotions, powders, the enjoyments of a householder, various types of servants, and a spouse—while still maintaining the purest conduct?

source: སྲོག་གཅོད་པ་དང་། རྐུ་འཕྲོག་བགྱིད་པ་དང་། བརྫུན་གྱི་ཚིག་དང་། སྐྱེམས་འཚལ་བ་ལ་སོགས་པ་ལ་རྟེན་ཅིང་ལས་རྣམས་བགྱིད་ལ་བུ་དང་། ཆུང་མ་རྣམས་སྟེན་ཀྱང་ཤིན་ཏུ་ཚངས་པར་སྤྱོད་པར་ཡང་འགྱུར་བ་དང་།
en: How can we engage in all such activities as killing, stealing, lying, hankering after drink, and so forth, and keeping company with spouses and children, while still maintaining the purest conduct?

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་མཆོད་པར་ཡང་འགྱུར་བ་དང་།
en: “How can we receive offerings from all the tathāgatas?

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་རྗེད་པར་ཡང་འགྱུར་བ་དང་།
en: How can we become honored by all the tathāgatas?

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་ཆེར་བཀུར་བར་ཡང་འགྱུར་བ་དང་།
en: How can we become well respected by all the tathāgatas?

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་སྡུག་པར་བྱ་བའི་སྲས་སུ་ཡང་འགྱུར་བ་དང་།
en: How can we become a beloved child of all the tathāgatas?

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་བྱས་པ་གཟོ་བའི་བགོ་སྐལ་ལ་སྤྱོད་པར་ཡང་འགྱུར་བ་དང་།
en: How can we proceed with proper appreciation of all the tathāgatas’ kindness?

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཕྲིན་ལས་མཚུངས་པའི་ཆོས་ཀྱི་དེ་ཁོ་ན་མཐོང་བར་ཡང་འགྱུར་བ་དང་།
en: How can we see the reality of phenomena, which is equivalent to the activity of all the tathāgatas?

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡེ་ཤེས་ཀྱི་ཡང་དག་པར་རྟོག་པ་མཚུངས་པར་ཡང་འགྱུར་བ་དང་།
en: “How can we attain the authentic understanding of gnosis that is the same as that of all the buddhas?

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་གསང་བ་རྣམ་པ་མང་པོ་ལུང་བསྟན་པའི་ཡུལ་སྤྱིས་བཙན་པའི་རྒྱལ་པོར་ཡང་འགྱུར་བ་དང་།
en: How can we become crowned as the ruler of the land of the authoritative explanations of the manifold secret aspects of the doctrines of all buddhas?

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་གསང་བའི་ཆོས་སྟོན་པ་རྣམ་པ་དུ་མ་བརྗོད་པར་ཡང་འགྱུར་བ་དང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བཞེད་པའི་ང་རྒྱལ་ལ་གནས་པའི་ཡུལ་ལ་མཁས་པར་ཡང་འགྱུར་བ་དང་།
en: How can we express the manifold aspects of the secret Dharma teachings of all buddhas? How can we become skilled at abiding within the state of pride accepted by all the buddhas?

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་འདོད་ཆགས་མ་མཆིས་པ་དང་། དྲི་མ་མ་མཆིས་པ་དང་། འཇིགས་པ་མ་མཆིས་པ་གསང་བ་རྣམ་པ་མང་པོའི་ཆོས་སྟོན་པའི་རང་བཞིན་དག་ལ་རིན་པོ་ཆེ་ལྟ་བུར་ཡང་འགྱུར་བ་དང་།
en: How can we attain the jewel-like pure nature of the Dharma teachings of all the buddhas, with their manifold secret aspects—desirelessness, stainlessness, and fearlessness?

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སེམས་ཅན་གདུལ་བའི་དབང་གིས་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་། འཇིགས་པའི་ཆོས་ཀྱི་ཕྱོགས་ཐམས་ཅད་ལ་འཇུག་པ་ཡང་དག་པར་མཐོང་བར་ཡང་འགྱུར་བ་དང་།
en: How can we correctly see and engage in all the phenomena such as desire, anger, ignorance, and fear, through the power by which all the buddhas tame sentient beings?

source: སངས་རྒྱས་ཐམས་ཅད་ཡུན་རིང་པོ་བསྐལ་པ་བྱེ་བ་བགྲངས་པ་མང་པོ་ནས་རྒལ་ནས་ཉོན་མོངས་པའི་རྒྱ་མཚོ་ལས་གྲོལ་བར་མཛད་པའི་གསང་བ་ཐམས་ཅད་ཀྱི་དེ་ཁོ་ན་མཐོང་བར་ཡང་འགྱུར་བ་དང་།
en: How can we see the suchness of all secrets, through which all the buddhas have attained liberation from the ocean of afflictions after passing through many millions of long eons?

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སེམས་ཅན་འདུལ་བའི་དབང་གིས་ཉོན་མོངས་པའི་རྒྱ་མཚོར་སྐྱེ་བར་བསྟན་ཏེརྒལ་ནས་བསྒྲལ་བར་བྱའོ། །
en: How can we display birth within the ocean of afflictions through the power by which all the buddhas tame sentient beings?

source: གྲོལ་ནས་དགྲོལ་བར་བྱའོ་སྙམ་ནས་བསྟན་པའི་གསང་བའི་ཁྱད་པར་གྱི་སྒོའི་རང་བཞིན་དག་མཐོང་བར་ཡང་འགྱུར་བ་དང་།
en: And, with the thought that ‘having crossed over, I will attain liberation; having attained liberation, I will liberate others,’ how can we see the pure nature of the special secret gateways that have been taught?

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡུན་རིང་པོ་བསྐལ་པ་བྱེ་བ་བགྲངས་པ་མང་པོ་འདས་པ་ནས་བདུད་བྱེ་བ་རབ་ཏུ་བཅོམ་པའི་རྣམ་པ་གསང་བའི་དེ་ཁོ་ན་མཐོང་བར་ཡང་འགྱུར་བ་དང་།
en: How can we behold the reality of the secret ways by which all the buddhas, having passed beyond many millions of long eons, have vanquished millions of māras?

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་སེམས་ཅན་འདུལ་བའི་དབང་གི་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་དུ་བདུད་འདུལ་བའི་གསང་བའི་ཁྱད་པར་གྱི་སྒོའི་རང་བཞིན་སྟོན་པ་ལྟ་བུར་བཅོས་པ་ལེགས་པར་མཐོང་བར་ཡང་འགྱུར་བ་དང་།
en: How can we, through the power by which all the buddhas tame sentient beings, see well the contrivance, which appears as a natural display, of the special, secret gateway of subduing Māra at the base of the Bodhi tree?

source: ཐབས་ཀྱིས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་།
en: “How can we turn the wheel of Dharma through skillful means?

source: ཐབས་ཀྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ལྟ་བུར་བཅོས་པའི་དེ་ཁོ་ན་མཐོང་བར་ཡང་འགྱུར་བ་དང་།
en: How can we see the reality of the contrivance wherein, through skillful means, it appears that one passes into parinirvāṇa?

source: སངས་རྒྱས་ཐམས་ཅད་རོལ་པའི་གསང་བའི་རྒྱལ་པོའི་མཆོག་ཏུ་ཡང་འགྱུར་བ་དང་།
en: How can we become the supreme king of the secret display of all the buddhas?

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ། མཚུངས་པ་མ་མཆིས་པ། དཔེ་མ་མཆིས་པ། གྲངས་མ་མཆིས་པ། དཔག་ཏུ་མ་མཆིས་པ། བགྲང་བ་ལས་འདས་པ་ལ་བགྲང་བའི་རྒྱལ་པོར་ཡང་འགྱུར་བའི་བྱང་ཆུབ་སེམས་དཔའི་མདོ་གང་ལགས།
en: How can we become the king who enumerates the inconceivable, unparalleled, incomparable, countless, limitless, innumerable domains of all the buddhas? Which bodhisattva discourse contains such teachings?”

source: དེ་སྐད་ཅེས་གསོལ་ནསབཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སྤྲིན་ཆེན་སྙིང་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: Then, having been entreated in this fashion, the Bhagavān replied to the bodhisattva Great Cloud Essence,

source: སྤྲིན་ཆེན་སྙིང་པོ་ལེགས་སོ་ལེགས་སོ། །
en: “Great Cloud Essence, excellent, excellent!

source: སྤྲིན་ཆེན་སྙིང་པོ་ཁྱོད་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། བདེ་བ་དང་། སེམས་ཅན་དམུས་ལོང་དུ་གྱུར་པ་རྣམས་ལ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་ཀྱི་བསྔགས་པ་བརྗོད་པའི་དེ་ཁོ་ན་ཤེས་པའི་མིག་གི་རྒྱུའི་དོན་དང་།
en: Great Cloud Essence, to benefit and comfort all sentient beings, and for the welfare of all blind sentient beings, you have uttered these well-spoken words for the sake of attaining the greatness of qualities that is praised by all the tathāgatas. You have spoken for the sake of the eye of gnosis that knows reality.

source: རྟག་ཏུ་མིག་མཐོང་བར་བྱ་བའི་དོན་དང་། འཁོར་བའི་ཉོན་མོངས་པའི་རྒྱ་མཚོའི་ཕ་རོལ་ཏུ་ངེས་པར་བསྒྲལ་བའི་དོན་དང་།
en: You have spoken for the sake of always seeing truly. You have spoken for the sake of crossing to the other shore of the ocean of the afflictions of cyclic existence.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་དོན་དང་།
en: You have spoken for the sake of fully understanding the bodhisattva conduct of all tathāgatas.

source: འཁོར་བའི་རྒྱ་མཚོའི་ཉོན་མོངས་པའི་སྒོ་ངའི་སྦུབས་ཡོངས་སུ་བརྟོལ་ཏེབྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་རྗེས་སུ་ཡང་དག་པར་བསླབས་ནས་ཕྱིར་ཡང་འཁོར་བའི་རྒྱ་མཚོའི་ཉོན་མོངས་པའི་སྒོ་ངའི་སྦུབས་སུ་ཐབས་ཀྱིས་འཇུག་པར་བྱ་བའི་དོན་དང་།
en: You have spoken for the sake of breaking open the eggshell of the afflictions of the ocean of cyclic existence and then, having correctly trained in the bodhisattva conduct, skillfully reentering the eggshell of the afflictions of the ocean of cyclic existence.

source: མི་རྟག་པ་དང་། སྟོང་པ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་དང་། བདག་མེད་པའི་བསྔགས་པ་བརྗོད་པའི་སེམས་ཅན་རྣམས་ལ་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་རྟག་པ་དང་། ཐེར་ཟུག་པ་དང་། བརྟན་པ་དང་། ཞི་བའི་རང་བཞིན་གྱི་བདག་ཉིད་དུ་གནས་པར་ཡོངས་སུ་བརྟན་པའི་དོན་དང་།
en: “You have spoken for the sake of causing all sentient beings who praise impermanence, emptiness, parinirvāṇa, and selflessness to gain abiding confidence in the greatness of the qualities of the buddha—the essential nature of parinirvāṇa as permanent, eternal, constant, and tranquil.

source: ཆོས་ནུབ་པར་འགྱུར་བར་སྨྲ་བའི་སེམས་ཅན་རྣམས་ལ་དམ་པའི་ཆོས་བསྟན་པའི་རང་བཞིན་གྱི་མིག་རྣམ་པར་སྦྱང་བའི་དོན་དང་།
en: You have spoken for the sake of causing all sentient beings who claim that the Dharma will disappear to gain the completely pure eye that sees the steadfast nature of the sacred Dharma.

source: ལྷའི་གནས་ཀྱི་གཟུགས་ཐམས་ཅད་ལ་ལོག་པར་ལྟ་བའི་དུག་གིས་ཕོག་པའི་སེམས་ཅན་རྣམས་ལ་ཕྱིར་གསོ་བའི་ལས་ཆེན་པོའི་ཆོ་ག་སྐྱུག་སྨན་དང་བཀྲུ་སྨན་བཏང་བའི་དོན་དང་།
en: You have spoken for the sake of performing great healing techniques on all sentient beings who have been struck by the poison of wrong views regarding all the forms of the godly abodes, by treating them with purgative and cleansing medicines.

source: དེ་བཞིན་གཤེགས་པའི་ལྡེམ་པོ་དག་ལ་སེམས་ཡོངས་སུ་རྨོངས་ཤིང་རྣམ་པར་འཁྲུལ་པའི་སེམས་ཅན་རྣམས་ལ་ཡང་དག་པའི་རིག་སྔགས་བརྗོད་ཅིང་ཆུའི་བུམ་པ་ཐོགས་པ་གསང་སྔགས་ཀྱི་སྦྱོར་བའི་ཆོ་གའི་སྨན་གནོད་སེལ་ལ་མཁས་པའི་སྨན་པ་ཆེན་པོ་ཡོངས་སུ་གཟུང་བའི་དོན་དང་།
en: You have spoken for the sake of assuming the role of a great doctor skilled in the harm-dispelling medicine of the yogic techniques of secret mantra, uttering the correct knowledge mantras, and raising up the water-filled consecration vase for all sentient beings whose minds are thoroughly clouded and confused regarding the concealed intent of the tathāgata’s words.

source: སྤྱོད་པ་པ་དང་། ཀུན་ཏུ་རྒྱུ་དང་། གཅེར་བུ་པ་ལ་སོགས་པ་འོས་མ་ཡིན་པའི་ལྷའི་གཟུགས་རྣམས་ལ་རྟག་པ་དང་། འོས་པའི་རང་བཞིན་དུ་འཛིན་པའི་དུག་གིས་ཕོག་པའི་སེམས་ཅན་རྟག་པ་དང་། འོས་པར་སྨྲ་བ་རྣམས་ལ་དུག་ཧ་ལ་ཧ་ལའི་ཟུག་རྔུ་དབྱུང་བའི་ཕྱིར་མི་རྟག་པ་དང་། འོས་མ་ཡིན་པ་དང་། ལྷ་མ་ཡིན་པའི་ལྟ་བ་མི་སྟོན་པར་བྱ་བའི་དོན་དང་། མི་རྟག་པ་དང་། འོས་མ་ཡིན་པ་དང་།
en: “You have spoken for the sake of not revealing a view that is impermanent, unworthy, and not divine, in order to extract the poisoned arrow of affliction from those sentient beings such as the carakas, wanderers, nirgranthas, and others, who have been struck by the poison of grasping at unworthy divine forms as having a nature that is permanent and worthy and thus profess their permanence and worthiness.

source: ལྷ་མ་ཡིན་པའི་ལྟ་བ་རྣམ་པར་སྦྱང་བར་བྱ་བའི་དོན་དང་། མི་རྟག་པ་དང་། འོས་མ་ཡིན་པ་དང་།
en: You have spoken for the sake of purifying away those views that are impermanent, unworthy, and not divine.

source: ལྷ་མ་ཡིན་པའི་ལྟ་བས་བཅིངས་པ་ལས་དགྲོལ་བའི་དོན་དང་། མི་རྟག་པ་དང་། འོས་མ་ཡིན་པ་དང་།
en: You have spoken for the sake of liberating others from being bound by those views that are impermanent, unworthy, and not divine.

source: ལྷ་མ་ཡིན་པའི་ལྟ་བའི་ནད་གཞི་སྐྱུག་པ་དང་བཀྲུ་བའི་དོན་དང་། མི་རྟག་པ་དང་། འོས་མ་ཡིན་པ་དང་།
en: You have spoken for the sake of causing others to purge and cleanse themselves of the causes of the illness of the views that are impermanent, unworthy, and not divine.

source: ལྷ་མ་ཡིན་པའི་ལྟ་བའི་དུག་གིས་སྐྲངས་པ་གཏར་བའི་དོན་དང་། མི་རྟག་པ་དང་། འོས་མ་ཡིན་པ་དང་།
en: You have spoken for the sake of lancing the tumors caused by the poison of the views that are impermanent, unworthy, and not divine.

source: ལྷ་མ་ཡིན་པའི་ལྟ་བའི་དུག་གིས་རྣམ་པ་འདྲེས་པའི་མིག་གི་ཤ་འཛེར་གཅད་པའི་དོན་དང་།
en: You have spoken for the sake of cutting out the fleshy growths that have completely obscured the eyesight of others who have been poisoned by the views that are impermanent, unworthy, and not divine.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དུས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ལ་འཇུག་པའི་གནས་དང་། སྤྱོད་ཡུལ་དང་། གདུང་དང་། མཚན་དང་། ཞིང་དང་། དེ་ཁོ་ན་ཉིད་མཁྱེན་པ་དང་། རོ་དང་། ཁ་ཟས་ཞིམ་པོ་དང་། བདེ་བར་བྱེད་པའི་བསྙེན་བཀུར་བ་དང་། ཆེ་བ་ལ་འོས་པའི་མལ་སྟན་བདེ་བ་དང་། བཏུང་བ་དང་། ཁྲུས་དང་། སྤོས་དང་། མེ་ཏོག་ཕྲེང་དང་། ཕྱེ་མས་བསྒོ་བ་དང་། བདུག་པ་དང་གོས་ཀྱི་མཆོག་ཕྲ་ཞིང་ཤིན་ཏུ་ཕྲ་བ་དང་། རབ་ཏུ་མཛེས་པ་ཡང་དག་པར་བསྟན་པའི་དོན་དང་།
en: “You have spoken for the sake of correctly revealing the entry point into the timely emanation of all the tathāgatas as well as into the domain of activity, the heritage, the marks, the fields, the knowledge of reality, the taste, the delicious sustenance, the devotion to cause happiness, the pleasing and worthy bed of great qualities, the drinks, the ablutions, the incense, the flower garlands, the application of colored powders, the supremely and extremely fine garments, and the adornment of all the tathāgatas.

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་ཆོས་ཀྱི་སྐུ་ཡིན་པར་ཡང་དག་པར་བསྟན་པའི་དོན་དུ་ཁྱོད་ཀྱིས་ཚིག་འདི་ལེགས་པར་སྤྲས་པ་ནི་ཡང་ལེགས་སོ། །
en: You have spoken for the sake of correctly teaching that the Tathāgata’s body is the Dharma body. For these purposes, these words of yours were excellently spoken. Excellent!

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་དེ་ཡང་ཤིན་ཏུ་ཟབ་པའི་མཚན་ཏེ། མཚན་ཉིད་གཅིག་པ་ཡང་མ་ཡིན།
en: “The Tathāgata’s body possesses the most profound characteristics, yet it does not have a single characteristic.

source: མཚན་གྱི་གཞི་མེད་པ་ཡང་མ་ཡིན། མཚན་གྱི་གཞི་མངོན་པ་ཡང་མ་ཡིན།
en: It is not without something to characterize, yet the thing characterized is not apparent.

source: རྟོགས་པར་འགྱུར་བ་ཡང་མ་ཡིན། རྟོགས་པར་མི་འགྱུར་བ་ཡང་མ་ཡིན།
en: It is not something to be realized, yet it is not not something to be realized.

source: ཚུ་རོལ་ན་ཡང་མ་ཡིན། ཕ་རོལ་ན་ཡང་མ་ཡིན། བར་ན་ཡང་མ་ཡིན།
en: It is not on this side and it is not on the other side, yet it is not in between.

source: ཐོག་མ་ཡང་མ་ཡིན། ཐོག་མ་མེད་པ་ན་ཡང་མ་ཡིན།
en: It is not an origin, yet it is not without an origin.

source: འདི་ན་ཡང་མ་ཡིན། གཞན་ན་ཡང་མ་ཡིན།
en: It is not here, yet it is not there.

source: རྟག་པ་ཡང་མ་ཡིན། མི་རྟག་པ་ཡང་མ་ཡིན།
en: It is not permanent, yet it is not impermanent.

source: ཚད་མར་བྱ་བ་ཡང་མ་ཡིན། ཚད་མར་མི་བྱ་བ་ཡང་མ་ཡིན།
en: It cannot be validated, yet it cannot be invalidated.

source: མཚན་མོ་ཡང་མ་ཡིན། མཚན་མོ་མ་ཡིན་པ་ཡང་མ་ཡིན།
en: It is not benighted, yet it is not notbenighted.

source: ཆུང་ངུ་ཡང་མ་ཡིན། ཆུང་ངུ་མ་ཡིན་པ་ཡང་མ་ཡིན།
en: It is not little, yet it is not not little.

source: ཡང་བ་ཡང་མ་ཡིན། ཡང་བ་མ་ཡིན་པ་ཡང་མ་ཡིན།
en: It is not lightweight, yet it is not not lightweight.

source: རྣམ་པར་ཤེས་པར་བྱ་བ་ཡང་མ་ཡིན། རྣམ་པར་ཤེས་པར་མི་བྱ་བ་ཡང་མ་ཡིན།
en: It is not cognizable, yet it is not uncognizable.

source: རྣམ་པར་ཤེས་པས་ཤེས་པར་བྱ་བ་ཡང་མ་ཡིན། རྣམ་པར་ཤེས་པས་ཤེས་པར་མི་བྱ་བ་ཡང་མ་ཡིན།
en: It is not known by consciousness, yet it is not not known by consciousness.

source: མི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་མ་ཡིན་པ་ཡང་མ་ཡིན།
en: It is not abiding, yet it is not nonabiding.

source: མུན་པ་ཡང་མ་ཡིན། སྣང་བ་ཡང་མ་ཡིན།
en: It is not obscured, yet it is not illuminated.

source: མིང་ཡང་མ་ཡིན། མཚན་མ་ཡང་མ་ཡིན།
en: It is not a name, nor is it a sign.

source: མཐུ་ཆུང་བ་ཡང་མ་ཡིན། སྟོབས་དང་ལྡན་པ་ཡང་མ་ཡིན།
en: It is not weak, nor is it strong.

source: ཡུལ་ན་གནས་པ་ཡང་མ་ཡིན། ཕྱོགས་ན་གནས་པ་ཡང་མ་ཡིན།
en: It does not abide in any place, nor does it abide in any direction.

source: དགེ་བ་ཡང་མ་ཡིན། མི་དགེ་བ་ཡང་མ་ཡིན།
en: It is not virtuous, yet it is not unvirtuous.

source: འདུས་བྱས་ཀྱང་མ་ཡིན། འདུས་མ་བྱས་ཀྱང་མ་ཡིན་
en: It is not conditioned, yet it is not unconditioned.

source: ག་ཞིག་ན་ཡོད་དོ་ཞེས་བརྗོད་དུ་རུང་བ་ཡང་མ་ཡིན།
en: “It cannot be described as ‘It exists in such-and-such a place.’

source: སྦྱིན་པར་ཡང་མ་ཡིན། ལེན་པར་ཡང་མ་ཡིན།
en: It cannot be offered, nor can it be taken.

source: ཚིག་ཏུ་བརྗོད་དུ་རུང་བ་ཡང་མ་ཡིན། ཚིག་ཏུ་བརྗོད་དུ་མི་རུང་བ་ཡང་མ་ཡིན།
en: It is not describable in words, yet it is not indescribable in words.

source: བདེན་པར་ཡང་མ་ཡིན། བརྫུན་པར་ཡང་མ་ཡིན།
en: It is not true, yet it is not false.

source: ཡང་དག་པ་ཉིད་དུ་ཡང་མ་ཡིན། ལྟ་བར་ཡང་མ་ཡིན།
en: It is not true reality itself, yet it is not a metaphysical view.

source: ངེས་པར་འབྱུང་བར་ཡང་མ་ཡིན། ངེས་པར་མི་འབྱུང་བར་ཡང་མ་ཡིན།
en: It is not emancipated from cyclic existence, yet it is not not emancipated.

source: ཞིང་དུ་ཡང་མ་ཡིན། ཞིང་མ་ཡིན་པར་ཡང་མ་ཡིན།
en: It is not a field, yet it is not not a field.

source: དུས་ཀྱང་མ་ཡིན། དུས་མ་ཡིན་པར་ཡང་མ་ཡིན།
en: It is not temporal, yet it is not atemporal.

source: སྦྱང་བར་བྱ་བ་ཡང་མ་ཡིན། སྦྱང་བར་མི་བྱ་བ་ཡང་མ་ཡིན།
en: It cannot be undertaken, yet it cannot not be undertaken.

source: གཙང་བ་ཡང་མ་ཡིན། མི་གཙང་བར་ཡང་མ་ཡིན།
en: It is not clean, yet it is not unclean.

source: བྱས་པ་ཡང་མ་ཡིན། མ་བྱས་པ་ཡང་མ་ཡིན།
en: It is not made, yet it is not unmade.

source: སྐྱེས་པ་ཡང་མ་ཡིན། འགག་པ་ཡང་མ་ཡིན།
en: It is not produced, yet it does not cease.

source: ཞི་བ། རབ་ཏུ་ཞི་བ། ཉེ་བར་ཞི་བ་སྟེ།
en: It is at peace, deeply at peace, fully at peace.

source: ཁམས་ཀྱང་མ་ཡིན། ཕུང་པོ་ཡང་མ་ཡིན། སྐྱེ་མཆེད་ཀྱང་མ་ཡིན།
en: It is not the elements, it is not the aggregates, and it is not the sense bases.

source: ཁམས་ཀྱིས་བསྐྱེད་པ་ཡང་མ་ཡིན། ཕུང་པོས་བསྐྱེད་པ་ཡང་མ་ཡིན། སྐྱེ་མཆེད་ཀྱིས་བསྐྱེད་པ་ཡང་མ་ཡིན།
en: It is not produced by the elements, it is not produced by the aggregates, and it is not produced by the sense bases.

source: ཉོན་མོངས་པའི་རྒྱུ་ལས་བྱུང་བ་ཡང་མ་ཡིན། ལས་ཀྱི་རྒྱུ་ལས་བྱུང་བ་ཡང་མ་ཡིན།
en: It does not arise from causes of affliction, and it does not arise from causes of karma.

source: བསགས་པ་ཡང་མ་ཡིན། མ་བསགས་པ་ཡང་མ་ཡིན་ལ།
en: It is not accumulated, yet it is not unaccumulated.

source: འཆི་འཕོ་མེད་པར་འཆི་འཕོ་བ།
en: “Without transmigrating after death, it transmigrates after death.

source: མུ་མེད་པ།
en: It is boundless.

source: འགྲོ་བ་མེད་པར་འགྲོ་བ།
en: It goes without going.

source: དཔུང་གཉེན་དུ་གྱུར་པ།
en: It lends assistance.

source: ཕྱི་མའི་མཐའ་མེད་པ།
en: It has no outer limits.

source: འཕོ་བ་མེད་པ།
en: It has no shifting.

source: ད་ལྟར་གྱི་དུས་ན་མི་གནས་པའི་རང་བཞིན་ཅན།
en: Its nature does not abide in the present.

source: གཟུགས་མེད་པ། ཚོར་བ་མེད་པ། འདུ་ཤེས་མེད་པ། འདུ་བྱེད་མེད་པ། རྣམ་པར་ཤེས་པ་མེད་པའི་དེ་བཞིན་ཉིད་ཀྱི་རང་བཞིན་མི་ཟད་པ།
en: Its nature of suchness, which has no form, no feeling, no cognition, no conceptual formations, and no consciousness, is inexhaustible.

source: ཟད་པར་བྱར་མི་རུང་བ། ཟད་པ་དང་བྲལ་བ།
en: It is incapable of being exhausted. It is free from exhaustion.

source: མི་མཉམ་པ། མི་མཉམ་པ་དང་མཉམ་པ།
en: It is unequaled. It is equal to the unequaled.

source: རྣམ་པར་ཤེས་པ་མ་ཡིན་པ།
en: It is not consciousness.

source: ཁམས་བཞི་ལས་ཡང་དག་པར་འདས་པ།
en: It is has truly passed beyond the four elements.

source: ཆོས་ཐམས་ཅད་ལ་མ་ཆགས་པའི་མཐར་ཕྱིན་པ།
en: It has reached the consummation of nonattachment to all phenomena.

source: ཡང་དག་པའི་མཐའ་མཐའ་མེད་པ་དེ་བཞིན་ཉིད་དང་མཉམ་པ་སྟེ།
en: It is equal to the unlimited suchness that is the ultimate limit of reality.

source: དེ་ལྟར་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་ཡོན་ཏན་དཔག་ཏུ་མེད་ཅིང་གྲངས་མེད་པ་དང་ལྡན་པ་ཡིན་ནོ། །
en: Thus, the Tathāgata’s body is endowed with unfathomable, incalculable qualities.

source: དེ་བཞིན་གཤེགས་པའི་འབེལ་བའི་གཏམ་གྱི་མཚན་ཉིད་ནི་འདི་ལྟ་བུ་ཡིན་ཏེ། ཕྲ་བའི་ཚིག་དང་། ཤིན་ཏུ་རྟོགས་པར་དཀའ་བ་དང་། ཤིན་ཏུ་བྱང་བ་དང་། ཤིན་ཏུ་ཟབ་པ་སྟེ།
en: “The characteristics of the Tathāgata’s prolific speech are like this: his subtle words are extremely difficult to understand, extremely skillful, and extremely profound.

source: ཕྱི་རོལ་པ་རྣམས་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དེ་དག་གིས་སྔོན་ཚིག་དང་ཡི་གེ་གཅིག་ཀྱང་མ་ཐོས་ཏེ་
en: All outsiders, as well as śrāvakas and pratyekabuddhas, have not heard his previous speeches—not even a single word.

source: དམུས་ལོང་དུ་གྱུར་ཅིང་དུག་གི་མཛོད་དུ་གྱུར་པ་དང་། གྲུམ་པོར་གྱུར་ཅིང་རྒས་པར་གྱུར་པ། སྲིད་པའི་སྒོ་ངའི་སྦུབས་ཀྱིས་གཡོགས་པ། གྲུ་ཞིགས་པ། དུག་གིས་ཕོག་པའི་ཟུག་རྔུས་ཡོངས་སུ་མྱོས་པར་བྱས་པ།
en: They have been rendered blind and full of poison, crippled and infirm, covered up by the eggshell of worldly existence, shipwrecked, and completely incapacitated by the poisoned arrow of affliction.

source: མཁྲིས་པས་བརྒྱལ་ཞིང་སེམས་རྣམ་པར་འཁྲུལ་པར་བྱས་པའི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་། སེམས་ཅན་ཐམས་ཅད་གསོ་བའི་ཆོ་ག་ཆེན་པོ་སྐྱུག་པ་དང་བཀྲུ་བའི་སྦྱོར་བ་དང་། གསང་སྔགས་དང་། ཡང་དག་པའི་རིག་སྔགས་བརྗོད་ཅིང་ཆུའི་བུམ་པ་ཐོགས་ཏེ་
en: “The Tathāgata’s prolific speech is for the sake of extracting the poisoned arrow of affliction, raising up the water-filled consecration vase, and proclaiming the correct knowledge mantras, secret mantras, and the yogic techniques that cause purging and cleansing—the great techniques that heal all śrāvakas and pratyekabuddhas, as well as all sentient beings, who have been rendered unconscious and delirious by illnesses of bile.

source: ཧ་ལ་ཧ་ལའི་དུག་གི་ཟུག་རྔུ་དབྱུང་བའི་དོན་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་སྒྲའི་བད་ཀན་དང་མཁྲིས་པ་སྙིང་ལ་ཞུགས་པ་གཅད་པའི་དོན་དང་།
en: It is for the sake of stopping the phlegm and bile regarding the term parinirvāṇa from entering their hearts.

source: དེ་དག་གི་ལྟོ་རྣམ་པར་སྦྱང་བའི་དོན་དང་།
en: It is for the sake of completely purifying their bellies.

source: དེ་དག་གི་དུག་གིས་སྐྲངས་པར་གྱུར་པ་གཏར་བའི་དོན་དང་།
en: It is for the sake of lancing their poisonous tumors.

source: ཕྱེ་མ་ལེབ་དང་། སྦུར་བུ་ལྟ་བུར་གྱུར་པ་དེ་དག་དུག་གིས་ཕོག་པ་དང་འཆི་བ་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་དོན་དང་།
en: It is for the sake of causing those who, like moths and ants, have been struck by poison and died, to gain total knowledge.
